app/controllers/urls_controller.rb

  def create
    shortUrl = ShortURL.shorten(params["url"])
    paramUrl = params["url"];
    @shortened_url = Url.new(url: paramUrl,shortenUrl: shortUrl)
    if @shortened_url.save
---
INSERT INTO `urls` (`created_at`, `shortenUrl`, `updated_at`, `url`) VALUES ('2018-06-12 17:44:00', 'http://tinyurl.com/ybxuvrd3', '2018-06-12 17:44:00', 'https://mail.google.com/mail/u/0/#inbox/FMfcgxvwzRcmvqhzNBRMmqkNvGFppZsw')

  def show
    debugger
    @shortened_url = Url.find(params[:id])
---
SELECT `urls`.* FROM `urls` WHERE `urls`.`id` = 20 LIMIT 1